
## Plan Result




<pre><code>Plan: 17 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_automation_account.automation_account
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.kv_rota.azurerm_key_vault.kv
  * module.kv_rota.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_rota.azurerm_key_vault_access_policy.developer[0]
  * module.kv_rota.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
  * module.kv_rota.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
* Update
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.automation_account will be created
  + resource "azurerm_automation_account" "automation_account" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "uksouth"
      + name                          = "hmi-stg-aa"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "hmi-sharedinfra-stg-rg"
      + sku_name                      = "Basic"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "true"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "true"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main will be created
  + resource "azurerm_automation_runbook" "main" {
      + automation_account_name = "hmi-stg-aa"
      + content                 = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
                Write-Host "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
                Write-host "Bypass required, add rule for $ip in $key_vault_name"
                Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
              Write-host "Removing rule for $ip in $key_vault_name"
              Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
            }
        EOT
      + description             = "This is a runbook to automate the recycling of SAS tokens on hmisastg"
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "uksouth"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "rotate-sas-tokens-hmisastg-rota-rl"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be created
  + resource "azurerm_automation_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + description             = "This is a schedule to automate the recycling of SAS tokens on hmisastg"
      + expiry_time             = (known after apply)
      + frequency               = "Day"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be created
  + resource "azurerm_automation_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + description             = "This is a one time trigger to automate the recycling of SAS tokens on hmisastg"
      + expiry_time             = (known after apply)
      + frequency               = "OneTime"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "true"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rlw"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rlw"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rlw"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "true"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rlw"
          + "remaining_days"       = "5"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rlw"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rlw"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_runbook.main will be created
  + resource "azurerm_automation_runbook" "main" {
      + automation_account_name = "hmi-stg-aa"
      + content                 = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
                Write-Host "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
                Write-host "Bypass required, add rule for $ip in $key_vault_name"
                Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
              Write-host "Removing rule for $ip in $key_vault_name"
              Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
            }
        EOT
      + description             = "This is a runbook to automate the recycling of SAS tokens on hmisastg"
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "uksouth"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "rotate-sas-tokens-hmisastg-rota-rlw"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be created
  + resource "azurerm_automation_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + description             = "This is a schedule to automate the recycling of SAS tokens on hmisastg"
      + expiry_time             = (known after apply)
      + frequency               = "Day"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be created
  + resource "azurerm_automation_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + description             = "This is a one time trigger to automate the recycling of SAS tokens on hmisastg"
      + expiry_time             = (known after apply)
      + frequency               = "OneTime"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_rota.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "hmi-kv-stg-shared-rota"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "hmi-sharedinfra-stg-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.kv_rota.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_rota.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_rota.azurerm_key_vault_access_policy.managed_identity_access_policy["4800c310-cd45-4e90-9cf9-857bd0e33759"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_rota.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "hmi-kv-stg-shared-rota"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = (known after apply)
          + category_group = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

Plan: 17 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":19,"Program":"tfcmt","SHA1":"","Vars":{}} -->